Documents/СтоимостьИзделия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>СтоимостьИзделия</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Замер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изделие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изделия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Двери</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дверь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Двери</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Деталь</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДеталей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавленоВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыДеталей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыДеталей</Name>
			<Comment>Виды деталей в стоимости изделия</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЛДСПосн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛДСПдоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кромка2ммОсн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кромка2ммДоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кромка05ммОсн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кромка05ммДоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрубаХром</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВешалоТорцевое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолкаСотовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кронштейн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПетляПростая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПетляУгловая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Направляющие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Крючки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Софиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трансформатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НогаХром</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Туканы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДВП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтеклоДляПолки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯщикВыдвижной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФасадАГТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Джокер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФасадПолукруглый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консоль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штангодержатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фланец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиДизайнера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугаГравировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажЗаднейСтенки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажКоробаПотолочного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажКоробаВертикального</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопДетали</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Двери.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Двери</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДвери</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДверей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаДвери</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаПолотна</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаПроема</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПерехлестов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаДляФлэш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаДляРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаДвери</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаПолотна</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаПроема</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавленоВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСОтходом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоДеталь</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/СтоимостьИзделия/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Замер") Тогда
		// Заполнение шапки
		Подразделение = ДанныеЗаполнения.Подразделение;
		Замер = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
	ДопДетали = Перечисления.ВидыДеталей.ДопДетали;
	
	Для ч = 0 По Перечисления.ВидыДеталей.Количество() - 1 Цикл
		Деталь = Перечисления.ВидыДеталей.Получить(ч); 
		
		Если Деталь <> ДопДетали Тогда
			
			НоваяСтрока = Номенклатура.Добавить();
			НоваяСтрока.Деталь = Деталь;
			Если Деталь = Перечисления.ВидыДеталей.ДВП Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ДВП;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.СтеклоДляПолки Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.СтеклоДляПолок;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.ЯщикВыдвижной Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ЯщикВыдвижной;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.ФасадАГТ Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ФасадАГТ;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.Джокер Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.Джокер;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.ФасадПолукруглый Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ФасадПолукруглый;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.Фланец Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.Фланец;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.Консоль Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.Консоль;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.Штангодержатель Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.Штангодержатель;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.УслугиДизайнера Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.УслугиДизайнера;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.УслугаГравировка Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.Гравировка;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.ДопРаботы Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ДопРаботы;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.МонтажЗаднейСтенки Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.МонтажЗаднейСтенки;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.МонтажКоробаВертикального Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.МонтажКоробаВертикального;
			ИначеЕсли Деталь = Перечисления.ВидыДеталей.МонтажКоробаПотолочного Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.МонтажКоробаПотолочного;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ТЗ = Справочники.Двери.ТекущаяСтоимостьНоменклатуры(Номенклатура, Дата, Подразделение, Ложь);
		Номенклатура.Загрузить(ТЗ);
	КонецЕсли;
	
КонецПроцедуры
